CSI API ETABS v1
cAreaObj.SetMaterialOverwrite Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetMaterialOverwrite(
	string Name,
	string PropName,
	eItemType ItemType = eItemType.Objects
)
Function SetMaterialOverwrite (
	Name As String,
	PropName As String,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim PropName As String
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetMaterialOverwrite(Name,
	PropName, ItemType)
int SetMaterialOverwrite(
	String^ Name,
	String^ PropName,
	eItemType ItemType = eItemType::Objects
)
abstract SetMaterialOverwrite :
        Name : string *
        PropName : string *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
PropName
Type: System.String
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace